package com.cbus.utils;

public interface TGConst {

    // 可用权限 按位运算 4字节 低位在前 低2个字节系统使用 高2个字节自定义
    // 00000000 00000000 00000000 00000000 0 无
    // 00000000 00000000 00000000 00000001 1 可读
    // 00000000 00000000 00000000 00000010 2 新增
    // 00000000 00000000 00000000 00000100 4 编辑
    // 00000000 00000000 00000000 00001000 8 删除
    // 00000000 00000000 00000000 00010000 16 导入
    // 00000000 00000000 00000000 00100000 32 导出
    // 00000000 00000000 00000000 01000000 64 审核
    // 00000000 00000000 00000000 10000000 128 取消
    
    /**
     * 权限 查看
     */
    int PERM_VIEW = 1;
    /**
     * 权限 新增
     */
    int PERM_ADD = 2;
    /**
     * 权限 编辑
     */
    int PERM_EDIT = 4;
    /**
     * 权限 删除
     */
    int PERM_DELETE = 8;
    /**
     * 权限 导入
     */
    int PERM_IMPORT = 16;
    /**
     * 权限 导出
     */
    int PERM_EXPORT = 32;
    /**
     * 权限 审核
     */
    int PERM_CHECK = 64;
    /**
     * 权限 取消
     */
    int PERM_CANCEL = 128;
    
    String ATTR_TOKEN_MODEL = "TOKEN_MODEL";
    String ATTR_CODE_DATA = "CODE_DATA";
}
